Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Therefore, go to https://code.quarkus.io[code.quarkus.io, window="_blank"], create a new project with the aloha extension and `org.acme` as Group (i.e xref:org-acme-package[`org.acme` placeholder for package name]). Prepare a nice starter. It should not include any business logic, instead, it should contain some stub data/hello world that compiles and gives an overview of how to use the extension. The idea is to bring code that is the most common starting point for the extension.
ja_jp: したがって、 link:https://code.quarkus.io[code.quarkus.io] に行き、alohaエクステンションと `org.acme` as Group（つまり、 xref:org-acme-package[org.acme パッケージ名のプレースホルダー] ）で新規プロジェクトを作成します。素敵なスターターを準備します。ビジネスロジックは含まず、代わりに、コンパイルしてエクステンションの使い方の概要を説明するスタブデータ/helloワールドを含むようにします。このアイデアは、エクステンションの最も一般的な出発点となるコードを持ってくることです。

source: Therefore, if you want to use a data class as an entity class, you need a way to make Kotlin generate an empty constructor. To do so, you need to provide default values for all the fields of your classes. The following sentence from the Kotlin documentation explains it:
ja_jp: そのため、データクラスをエンティティクラスとして使用したい場合は、Kotlinに空のコンストラクタを生成させる方法が必要です。そのためには、クラスのすべてのフィールドにデフォルト値を用意する必要があります。Kotlinのドキュメントの次の文章で説明しています。

source: Therefore, it is recommended that observer methods, both synchronous and asynchronous, are always declared `void`.
ja_jp: したがって、同期と非同期の両方のオブザーバーメソッドは常に `void` として宣言することを推奨します。

source: Therefore, remove the ngrok Let's Encrypt certificate policy from your ngrok domain:
ja_jp: よって、ngrok ドメインから ngrok Let's Encrypt 証明書ポリシーを削除します。

source: Therefore, resource methods can be separated into distinct OpenAPI documents. Only a few annotations and a bit of configuration are needed.
ja_jp: したがって、リソースメソッドを個別の OpenAPI ドキュメントに分割できます。これには、わずかなアノテーションと少しの設定のみが必要です。

source: Therefore, we recommend to stick with `@ApplicationScoped` by default unless there's a good reason to use `@Singleton`.
ja_jp: したがって、 `@Singleton` を使用する正当な理由がない限り、デフォルトで `@ApplicationScoped` を使用することをお勧めします。

source: These APIs are **generated**. Vert.x provides a code generator that _ translates_ the Vert.x "bare" API into the other APIs. Because all methods are well-formed, the generator understands how they should be adapted.
ja_jp: これらの API は *生成され* ます。Vert.x は、Vert.x の "むき出しの" API を他の API に変換するコード ジェネレーターを提供します。すべてのメソッドは整形されているので、ジェネレータはどのように適応されるべきかを理解しています。

source: These Netty metrics help evaluate how much room is needed.
ja_jp: これらのNettyメトリクスは、どのくらいの領域が必要かを評価するのに役立ちます。

source: These URLs can be either relative to the base `quarkus.oidc.auth-server-url` URL or absolute.
ja_jp: これらの URL は、ベースの `quarkus.oidc.auth-server-url` URL からの相対パス、または絶対 URL のいずれかにできます。

source: These adapters are available for most of the common Open Source logging components.
ja_jp: これらのアダプターは、Apache Commons Logging のような一般的なオープンソースのロギングコンポーネントのほとんどに対して存在します。

source: These adapters are available for popular open-source logging components, as explained in the next chapter.
ja_jp: これらのアダプターは、次の章で説明するように、人気のあるオープンソースのロギングコンポーネントで利用可能です。

source: These additional features are not covered by the CDI Lite TCK.
ja_jp: これらの追加機能は、CDI Lite TCK では対応していません。

source: These additional helpers are provided by the artifacts having Maven coordinates `io.quarkus:quarkus-test-h2` and `io.quarkus:quarkus-test-derby`, respectively for H2 and Derby.
ja_jp: これらの追加のヘルパーは、H2 と Derby 用にそれぞれ Maven 座標 `io.quarkus:quarkus-test-h2` と `io.quarkus:quarkus-test-derby` を持アーティファクトによって提供されています。

source: These annotations are meant to be used instead of the JAX-RS `@PathParam`, `@QueryParam` etc. annotations, without having the need to specify a name. The reason we chose not to reuse the same annotation names is to avoid conflicting with either JAX-RS or other EE specs:
ja_jp: これらのアノテーションは、JAX-RSの `@PathParam`, `@QueryParam` などのアノテーションの代わりに、名前を指定することなく使用することを意図しています。 同じアノテーション名を再利用しないことにしたのは、JAX-RSや他のEE仕様との衝突を避けるためです。

source: These annotations can be placed either on a Resource Method or a Resource Class (in which case it applies to all Resource Methods of the class that do *not* contain the same annotation) and allow users to return domain objects and not have to deal with building up the `Cache-Control` HTTP header explicitly.
ja_jp: これらのアノテーションはリソースメソッドまたはリソースクラス (この場合、同じアノテーションを *含まない* クラスのすべてのリソースメソッドに適用されます) に配置することができ、ユーザーがドメインオブジェクトを返すことができ、明示的に `Cache-Control` HTTP ヘッダーを構築することに対処する必要はありません。

source: These annotations can be present on a bindings source class:
ja_jp: バインディングソースクラスには次のアノテーションを配置できます。

source: These approaches become really powerful when combined with Quarkus configuration profiles. You can define different xref:config-reference.adoc#profiles[configuration profiles] to select different behaviors depending on your environment. This is great because you can define different combinations of Hibernate ORM properties matching the development style you currently need.
ja_jp: これらの方法は、Quarkusの設定プロファイルと組み合わせることで非常に強力になります。異なる xref:config-reference.adoc#profiles[設定プロファイル]を定義して、環境に応じて異なる動作を選択することができます。これは、現在必要としている開発スタイルに合わせて、Hibernate ORMのプロパティーの異なる組み合わせを定義できるという点で素晴らしいことです。

source: These approaches become really powerful when combined with Quarkus configuration profiles. You can define different xref:config.adoc#configuration-profiles[configuration profiles] to select different behaviors depending on your environment. This is great because you can define different combinations of Hibernate ORM properties matching the development style you currently need.
ja_jp: これらのアプローチは、Quarkusの設定プロファイルと組み合わせると非常に強力になります。 さまざまな xref:config.adoc#configuration-profiles[設定プロファイル] を定義して、環境に応じて異なる動作を選択できます。 これは、現在必要な開発スタイルに合わせて、Hibernate ORMプロパティのさまざまな組み合わせを定義できるためです。

source: These are explained below:
ja_jp: 以下にその内容をご紹介します。

source: These are links that reference other (external from Dev UI) data. This data can be HTML pages, text, or other data.
ja_jp: これらは、他の (Dev UI の外の) データを参照するリンクで、HTML ページ、テキスト、その他のデータがあります。

source: These are normal Quarkus config properties, so if you always want to build in a container it is recommended you add these to your `application.properties` in order to avoid specifying them every time.
ja_jp: これらは通常のQuarkusの設定プロパティーなので、常にコンテナーでビルドしたい場合は、毎回指定しなくて済むように、 `application.properties` に追加することをお勧めします。

source: These are regular Quarkus config properties, so if you always want to build in a container it is recommended you add these to your `application.properties` in order to avoid specifying them every time.
ja_jp: これらは通常の Quarkus 設定プロパティーであるため、常にコンテナーでビルドしたい場合は、 毎回指定しなくて済むように `application.properties` に追加することが推奨されます。

source: These are the classes we are going to use.
ja_jp: これらは、これから使うクラスファイルです。

source: These are the files created by the assembly plugin when invoking `./mvnw -Pdist package` on macOS:
ja_jp: これらのファイルは、macOS上で `./mvnw -Pdist package` を起動したときに、assembly プラグインによって作成されるファイルです。

source: These are the log levels used by Quarkus:
ja_jp: これらはQuarkusで使用されているログレベルです。

source: These are the metrics produced by the OpenTelemetry extension when metrics are enabled, as of June 12, 2025:
ja_jp: 以下は、2025 年 6 月 12 日現在、メトリクスが有効になっている場合に OpenTelemetry エクステンションによって生成されるメトリクスです。

source: These are the packages you'll need on your Linux environment to run through the different debugging sections:
ja_jp: これらのパッケージは、異なるデバッグセクションを実行するために、Linux環境で必要となるものです。

source: These blueprints demonstrate practical patterns and best practices for developing enterprise-grade AI solutions using a combination of these technologies. They aim to simplify the process of using AI in Java applications and guiding software architects along the way. Whether you're building intelligent chatbots, recommendation engines, or sophisticated data analysis tools, these blueprints provide a solid starting point for your next AI project. Explore each blueprint to discover how Quarkus and LangChain4j can enrich your Java applications with advanced AI capabilities.
ja_jp: これらのブループリントは、これらのテクノロジーの組み合わせを使用してエンタープライズグレードのAIソリューションを開発するための実践的なパターンとベストプラクティスを示します。これらは、JavaアプリケーションでのAIの使用プロセスを簡素化し、ソフトウェアアーキテクトを導くことを目的としています。インテリジェントなチャットボット、レコメンデーションエンジン、高度なデータ分析ツールを構築しているかどうかにかかわらず、これらのブループリントは次のAIプロジェクトのための確かな出発点を提供します。各ブループリントを調べて、QuarkusとLangChain4jが高度なAI機能でJavaアプリケーションをどのように豊かにできるかを発見してください。

source: These caches are kept locally, so they are not invalidated or updated when changes are made to the persistent store by other applications.
ja_jp: これらのキャッシュはローカルに保持されているため、他のアプリケーションによって永続ストアに変更が加えられても無効化されたり更新されたりすることはありません。

source: These can in turn be imported into a graph database, such as Neo4j, to inspect them more easily and run queries against the call tree. Let’s see this in action.
ja_jp: これらを Neo4j などのグラフデータベースにインポートして、より簡単に検査し、コールツリーに対してクエリーを実行できます。では、実際に見てみましょう。

source: These changes will directly benefit Quarkus build times, but since SmallRye OpenAPI is also used by other runtimes, they will positively impact the broader Java ecosystem as well.
ja_jp: これらの変更はQuarkusのビルド時間に直接的な利益をもたらしますが、SmallRye OpenAPIは他のランタイムでも使用されているため、より広範なJavaエコシステムにも良い影響を与えるでしょう。

source: These chunks are then converted into numerical representations (embeddings) using an "Embedding Model".
ja_jp: これらのチャンクは、「Embedding Model」を使用して数値表現（埋め込み）に変換されます。

source: These classes are provided by the `quarkus-test-vertx` dependency.
ja_jp: これらのクラスは、 `quarkus-test-vertx` の依存関係によって提供されます。

source: These code paths can be optionally reported when enabling printing of the analysis call tree. With Quarkus, this is achieved by passing in the `-Dquarkus.native.enable-reports` option.
ja_jp: これらのコードパスは、解析コールツリーの出力を有効にする際に、オプションで報告することができます。Quarkusでは、 `-Dquarkus.native.enable-reports` オプションを渡すことで実現できます。

source: These commands are marked as experimental, as we would need feedback before making them stable.
ja_jp: これらのコマンドは、stableになる前にフィードバックを必要とするため、experimentalとしてマークされています。

source: These components can also be injected with a specific persistence unit qualifier:
ja_jp: これらのコンポーネントは、特定の永続化ユニット修飾子を使用して注入することもできます。

source: These configuration properties require an additional extension. See <<coordination>>.
ja_jp: これらの設定プロパティには、追加のエクステンションが必要です。 <<coordination>> を参照してください。

source: These configuration properties require an additional extension. See xref:coordination[Coordination through outbox polling].
ja_jp: これらの設定プロパティは、追加のエクステンションを必要とします。 xref:coordination[outbox ポーリングによる調整] を参照してください。

source: These configuration properties work globally for all clients injected by CDI. If you want configure logging for a specific declarative client, you should do it by specifying named "client" properties, also known as `quarkus.rest-client."client".logging.*` properties.
ja_jp: これらの設定プロパティーは、CDI によって注入されたすべてのクライアントに対してグローバルに機能します。 特定の宣言型クライアントのロギングを設定する場合は、 `quarkus.rest-client."client".logging.*` プロパティーとも呼ばれる、名前付き "client" プロパティーを指定して設定する必要があります。

source: These descriptors are *NOT* considered to be production-ready. They are basic enough to deploy and run the system with as little configuration as possible. The databases, Kafka broker, and schema registry deployed are not highly-available and do not use any Kubernetes operators for management or monitoring. They also only use ephemeral storage.
ja_jp: これらの記述は、本番環境に対応しているとは考えて *いません*。これらは、できるだけ少ない設定でシステムをデプロイして実行するための基本的なものです。デプロイされたデータベース、Kafkaブローカー、スキーマレジストリは、高可用性を備えておらず、管理や監視にKubernetesのオペレータを使用していません。また、エフェメラルストレージのみを使用しています。

source: These endpoints are only available in dev mode, i.e. when you run your application via `mvn quarkus:dev` (or `./gradlew quarkusDev`).
ja_jp: これらのエンドポイントは、開発モード、つまり `mvn quarkus:dev` (または `./gradlew quarkusDev`) 経由でアプリケーションを実行する場合にのみ使用できます。

source: These endpoints are only available in the development mode, i.e. when you run your application via `mvn quarkus:dev` (or `./gradlew quarkusDev`).
ja_jp: これらのエンドポイントは開発モードでのみ使用できます。つまり `mvn quarkus:dev` (または `./gradlew quarkusDev`) 経由でアプリケーションを実行したときです。

source: These endpoints are protected and can only be accessed if a client is sending a bearer token along with the request, which must be valid (e.g.: signature, expiration and audience) and trusted by the microservice.
ja_jp: これらのエンドポイントは保護されており、クライアントがリクエストと一緒にベアラートークンを送信している場合にのみアクセスすることができます。

source: These endpoints are protected and can only be accessed if a client sends a bearer token along with the request, which must be valid (for example, signature, expiration, and audience) and trusted by the microservice.
ja_jp: これらのエンドポイントは保護されており、クライアントがリクエストとともにベアラートークンを送信した場合にのみアクセスできます。ベアラートークンは有効 (署名、有効期限、audience など) であり、マイクロサービスによって信頼されている必要があります。

source: These events have the following information.
ja_jp: これらのイベントには次の情報が含まれます。

source: These expert options are not considered part of the GraalVM native image API, so they might change anytime.
ja_jp: これらのエキスパートオプションは、GraalVM ネイティブ Image API の一部とは見なされないため、いつでも変更される可能性があります。

source: These expressions are resolved when the property is read. So if the configuration property is build time the property expression will be resolved at build time. If the configuration property is overridable at runtime it will be resolved at runtime.
ja_jp: これらの式は、プロパティーの読み込み時に解決されます。したがって、設定プロパティーがビルド時である場合、プロパティー式はビルド時に解決されます。設定プロパティーが実行時にオーバーライド可能になると、実行時に解決されます。

source: These extension methods can be used as follows.
ja_jp: これらの拡張メソッドは、以下のように使用することができます。

source: These extensions are the equivalent to the existing _quarkus-resteasy_* extensions, so simply switching from _quarkus-resteasy-jackson_ to _quarkus-resteasy-reactive-jackson_ in your application should allow you to try RESTEasy Reactive with Jackson integration.
ja_jp: これらのエクステンションは、既存の _quarkus-resteasy_* エクステンションと同等ですので、アプリケーション内で _quarkus-resteasy-jackson_ から _quarkus-resteasy-reactive-jackson_ に切り替えるだけで、Jackson 統合による RESTEasy Reactive を試すことができるようになります。

source: These features are handy for efficiently getting started on Qute templates and navigating through multiple template files!
ja_jp: これらの機能は、Quteのテンプレートを効率的に使い始め、複数のテンプレートファイルを操作するのに便利です

source: These files can contain multiple certificates and private keys. If this is the case, take either of the following actions:
ja_jp: これらのファイルには、複数の証明書と秘密鍵を含めることができます。その場合は、次のいずれかの操作を行ってください。

source: These files can include more than one certificate and private key. If this is the case, take either of the following actions:
ja_jp: このファイルには、複数の証明書と秘密鍵を含めることができます。 その場合は、次のいずれかの操作を実行してください。

source: These filters allow you to do various things such as examine the request URI, HTTP method, influence routing, look or change request headers, abort the request, or modify the response.
ja_jp: これらのフィルターを使用すると、リクエスト URI、HTTP メソッドの調査、ルーティングへの影響、リクエストヘッダーの検索または変更、リクエストの中止、レスポンスの変更など、さまざまなことができます。

source: These filters are registered by placing the `@io.quarkus.logging.LoggingFilter` annotation on a (`final`) class that implements `java.util.logging.Filter` and setting the `name` property.
ja_jp: これらのフィルタは、 `java.util.logging.Filter` を実装した ( `final` ) クラスに `@io.quarkus.logging.LoggingFilter` アノテーションを配置し、 `name` プロパティを設定することで登録されます。

source: These fixes contribute to a smoother coding experience, better overall performance, and, dare I say it, "developer joy".
ja_jp: これらの修正は、よりスムーズなコーディング体験、全体的なパフォーマンスの向上、そしてあえて言うなら「開発者の喜び」に貢献する。

source: These grants are `refresh_token` (with the external refresh token), `authorization_code`, and two grants which can be used to exchange the current access token, namely:
ja_jp: これらのグラントは、 `refresh_token` (外部リフレッシュトークンを使用)、 `authorization_code` 、および現在のアクセストークンを交換するために使用できる 2 つのグラント、すなわち以下のものです。

source: These guidelines ensure seamless integration of the Keycloak Admin Client with your REST framework, whether you are working with a REST server, a REST client, or both.
ja_jp: これらのガイドラインは、REST サーバー、REST クライアント、またはその両方で作業しているかどうかに関係なく、Keycloak Admin Client と REST フレームワークをシームレスに統合できるようにします。

source: These integrations make Mutiny a prominent and cohesive model for every reactive application developed with Quarkus. In addition, Mutiny architecture allows fine-grain dead-code elimination which improves the memory usage when compiled to native (such as with Quarkus native mode or GraalVM native image compiler).
ja_jp: これらの統合により、MutinyはQuarkusで開発されたすべてのリアクティブアプリケーションのための主要で凝集性のあるモデルとなっています。さらに、Mutinyのアーキテクチャでは、きめ細かなデッドコードの排除が可能で、ネイティブにコンパイルした場合（QuarkusのネイティブモードやGraalVMのネイティブイメージコンパイラなど）、メモリ使用量が改善されます。

source: These limitations are the result of Hibernate Search not coordinating between threads or application nodes by default.
ja_jp: これらはHibernate Searchがデフォルトではスレッドやアプリケーションノード間の調整を行わないことによる制限です。

source: These manifests can be deployed as is to a running cluster, using `kubectl`:
ja_jp: これらのマニフェストは、 `kubectl` を使用して、実行中のクラスターにそのままデプロイすることができます。

source: These materials are for JUGs who have tour dates booked and want access to promotional materials to use to create excitement and drum up attendance. We've written a couple versions of the session abstracts so you could find one that fits your JUGs personality, or go for it and create your own! We've also created some <a href="{{site.baseurl}}/worldtour/graphics">graphic resources</a> for social promotions a well.
ja_jp: これらの資料は、ツアー日程が予約されており、宣伝資料にアクセスして熱気を高め、参加者を増やすために使用したい JUG 向けです。セッションの概要をいくつか作成したので、JUG の個性に合わせて選択するか、独自のセッションを作成することもできます。ソーシャルプロモーション用の <a href="{{site.baseurl}}/worldtour/graphics">グラフィックリソース</a> も作成しました。

source: These methods are available for every kind of event in the associated group.
ja_jp: これらのメソッドは、関連するグループ内のあらゆる種類のイベントに対して利用可能です。

source: These methods have access to the _session-scoped_ `WebSocketConnection` bean.
ja_jp: これらのメソッドは、_セッションスコープ_ の `WebSocketConnection` Bean にアクセスできます。

source: These metrics can be disabled by setting the following properties to `false`:
ja_jp: これらのメトリクスは、次のプロパティーを `false` に設定することで無効にできます。

source: These metrics indicate the number of active thread-local caches used for memory pooling. It complements the cache size metrics (cache being the size, and this being the number of cache)
ja_jp: これらのメトリクスは、メモリプーリングに使用されるアクティブなスレッドローカルキャッシュの数を示します。これはキャッシュサイズメトリクス (キャッシュがサイズであり、これがキャッシュの数である) を補完します。

source: These metrics track the current memory usage by Netty allocators (in bytes)
ja_jp: これらのメトリクスは、Nettyアロケーターによる現在のメモリ使用量 (バイト単位) を追跡します。

source: These non application endpoints are normally accessible under the `/q` prefix like so:
ja_jp: これらの非アプリケーションエンドポイントは、通常、 `/q` のプレフィックスで次のようにアクセスします:

source: These numbers were obtained using a full recording of all classes loaded during startup. They were measured on our laptops rather than in an isolated lab environment. We plan to run a more comprehensive set of benchmarks in our lab soon.
ja_jp: これらの数値は、起動時にロードされたすべてのクラスを完全に記録して取得されました。これらは隔離されたラボ環境ではなく、私たちのラップトップで測定されました。近いうちに、ラボでより包括的なベンチマークセットを実行する予定です。

source: These origins consist of a single domain, scheme, and port. For the complete origin definition, see the link:https://datatracker.ietf.org/doc/html/rfc6454[Web Origin Concept] page.
ja_jp: これらのオリジンは1つのドメイン、スキーム、ポートで構成されています。 完全なオリジンの定義については、 link:https://datatracker.ietf.org/doc/html/rfc6454[ウェブオリジンのコンセプト] のページを参照してください。

source: These pages have instruction on how to use dev mode with xref:maven-tooling.adoc#dev-mode[Maven], link:gradle-tooling#dev-mode[Gradle] or with the xref:cli-tooling#development-mode[Quarkus CLI].
ja_jp: これらのページには、xref:maven-tooling.adoc#dev-mode[Maven] 、 link:gradle-tooling#dev-mode[Gradle] 、または xref:cli-tooling#development-mode[Quarkus CLI] を使用した開発モードの使用方法が記載されています。

source: These ports can be configured in your `application.properties` with the properties `quarkus.http.ssl-port` and `quarkus.http.test-ssl-port`.
ja_jp: これらのポートは、 `application.properties` のプロパティ `quarkus.http.ssl-port` と `quarkus.http.test-ssl-port` で設定することができます。

source: These properties are especially useful in the development mode or when running the tests where the generated/transformed classes are only held in memory in a class loader.
ja_jp: これらのプロパティは、開発モードやテストの実行時に、生成/変換されたクラスがクラスローダーのメモリ内に保持されているだけの場合に特に有効です。

source: These properties can also be globally configured using `pulsar.consumer` prefix:
ja_jp: これらのプロパティーは、 `pulsar.consumer` 接頭辞を使用してグローバルに設定することもできます。

source: These properties can also be globally configured using `pulsar.producer` prefix:
ja_jp: これらのプロパティーは、 `pulsar.producer` 接頭辞を使用してグローバルに設定することもできます。

source: These properties can be set through Java's `-D` command line parameter or on `application.properties`.
ja_jp: これらのプロパティは、Javaの `-D` コマンドライン・パラメータまたは `application.properties` で設定できます。

source: These properties configure the gRPC version and the `protoc` version.
ja_jp: これらのプロパティーは、gRPC バージョンと `protoc` バージョンを設定します。

source: These sites are now accessible via the drop-down "globe" menu in the top-right corner.
ja_jp: これらのサイトは、右上のドロップダウン「地球儀」メニューからアクセスできるようになりました。

source: These system properties above could be added to, e.g., a `surefire` and/or `failsafe` plugin configuration as
ja_jp: 上記のこれらのシステムプロパティーは、たとえば、以下のように `surefire` および/または `failsafe` プラグイン設定に追加できます。

source: These tenant resolution options are tried in the order they are listed until the tenant id gets resolved. If the tenant id remains unresolved (`null`), the default (unnamed) tenant configuration is selected.
ja_jp: これらのテナント解決オプションは、テナント ID が解決されるまで、リストされている順序で試行されます。 テナント ID が未解決のまま (`null`) の場合、デフォルト (名前なし) のテナント設定が選択されます。

source: These tests should be placed in the deployment module, if additional Quarkus modules are required for testing their deployment modules should also be added as test scoped dependencies.
ja_jp: これらのテストもデプロイメントモジュールに配置される必要があります。もし追加のQuarkusモジュールがテストに必要な場合は、それらのデプロイメントモジュールもテストスコープ付きの依存関係として追加しなければなりません。

source: These tests use http://rest-assured.io/[RestAssured], but feel free to use your favorite library.
ja_jp: これらのテストでは http://rest-assured.io/[RestAssured] を使用していますが、お好きなライブラリーをご自由にお使いください。

source: These tests use https://rest-assured.io/[RestAssured], but feel free to use your favorite library.
ja_jp: これらのテストでは http://rest-assured.io/[RestAssured] を使用していますが、普段利用しているライブラリーを自由に使用することも可能です。

source: These two issues still exist and I have no idea if we can even solve them, but we were able to mitigate their cost somewhat in Quarkus when using the specific packaging we developed for AOT.
ja_jp: これら 2 つの問題は依然として存在しており、解決できるかどうかもわかりませんが、AOT 用に開発した特定のパッケージングを使用することで、Quarkus ではそのコストをある程度軽減することができました。

source: These two properties allow to specify if the OIDC tenant configuration should be enabled and the OIDC tenant name.
ja_jp: これら 2 つのプロパティーにより、OIDC テナント設定を有効にするかどうかと、OIDC テナント名を指定できます。

source: These two properties should not be used in production.
ja_jp: これら 2 つのプロパティーは、実稼働環境では使用しないでください。

source: These two types allow representing any type of interactions. They are event sources. You observe them (_subscription_) and you get notified when they emit an item, a failure, or, in the case of a bounded Multi, a completion event. When you (the subscriber) receive the event, you can process it (e.g., transform it, filter it). With Mutiny, you are going to write code like _onX().action()_, which reads as “on item X do action”.
ja_jp: この2つのタイプは、あらゆるタイプのインタラクションを表現することができます。これらはイベントソースです。ユーザーはこれらを監視し（ _サブスクリプション_ ）、アイテムの出力、失敗、またはバインドされたMultiの場合は完了イベントが発行されると通知を受け取ります。あなた（サブスクライバー）がイベントを受け取ると、それを処理することができます（例えば、変換したり、フィルタリングしたり）。Mutinyでは、 _onX().action()_のようなコードを書くことになりますが、これは「アイテムXの場合actionを実施」と読み替えられます。

source: These types differ from the Java types mentioned in those tutorials. For Kotlin support, all the Panache types will be found in the `io.quarkus.hibernate.orm.panache.kotlin` package. This subpackage allows for the distinction between the Java and Kotlin variants and allows for both to be used unambiguously in a single project.
ja_jp: これらの型は、それらのチュートリアルで言及されている Java のタイプとは異なります。Kotlin のサポートのために、すべての Panache の型は `io.quarkus.hibernate.orm.panache.kotlin` パッケージにあります。このサブパッケージは、Java と Kotlin の違いを区別し、単一のプロジェクトで両方を明確に使用することを可能にします。
